---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeSlopeError
source: html/f3dc0e0f-5926-6bfb-6c2d-0a8596dd3112.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeSlopeError Property

The connected fitting(s) cannot successfully change to the new slope value. You may try to disconnect the connections on the fitting(s) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeSlopeError { get; }
```